package org.dongfu.study.ioc.ioc04;
/**
* @description: TODO
* @author majiajian
* @date 2022/9/7 18:18
* @version 1.0
*/

public class Doc {
    /**
     *  本章节的主要以完善实例化操作，增加 InstantiationStrategy 实例化策略接口，并
     *  新增了两个实例化类。这部分类的名称与实现方式基本是 Spring 框架的一个缩小
     *  版，大家在学习过程中也可以从 Spring 源码找到对应的代码。
     *  从我们不断的完善增加需求可以看到的，当你的代码结构设计的较为合理的时候，
     *  就可以非常容易且方便的进行扩展不同属性的类职责，而不会因为需求的增加导致
     *  类结构混乱。所以在我们自己业务需求实现的过程中，也要尽可能的去考虑一个良
     *  好的扩展性以及拆分好类的职责。
     *  动手是学习起来最快的方式，不要让眼睛是感觉看会了，但上手操作就废了。也希
     *  望有需要的读者可以亲手操作一下，把你的想法也融入到可落地实现的代码里，看
     *  看想的和做的是否一致
     */
}
