package org.wanbang.study.allDesignMode.factoryMode;
/**
 * @description: TODO
 * @author majiajian
 * @date 2022/8/10 17:15
 * @version 1.0
 */

public class doc {
//    从上到下的优化来看，⼯⼚⽅法模式并不复杂，甚⾄这样的开发结构在你有所理解后，会发现更加
//    简单了。
//    那么这样的开发的好处知道后，也可以总结出来它的优点； 避免创建者与具体的产品逻辑耦合 、 满
//    ⾜单⼀职责，每⼀个业务逻辑实现都在所属⾃⼰的类中完成 、 满⾜开闭原则，⽆需更改使⽤调⽤⽅就可以
//    在程序中引⼊新的产品类型 。但这样也会带来⼀些问题，⽐如有⾮常多的奖品类型，那么实现的⼦
//    类会极速扩张。因此也需要使⽤其他的模式进⾏优化，这些在后续的设计模式中会逐步涉及到。
//    从案例⼊⼿看设计模式往往要⽐看理论学的更加容易，因为案例是缩短理论到上⼿的最佳⽅式，如
//    果你已经有所收获，⼀定要去尝试实操。
}
